{
  "primary": "TDP43",
  "interaction_type": "direct",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "Dipeptide repeat (DPR) proteins, particularly poly-GR and poly-PR, translated from the C9orf72 hexanucleotide repeat expansion, directly interact with TDP-43, promoting its aggregation and contributing to neurodegeneration.",
  "functions": [
    {
      "function": "TDP-43 Aggregation",
      "arrow": "activates",
      "cellular_process": "Dipeptide repeat (DPR) proteins, particularly poly-glycine-arginine (poly-GR), translated from the C9orf72 repeat expansion, directly interact with TDP-43 and promote its misfolding and aggregation.",
      "effect_description": "The arginine-rich DPRs (poly-GR and poly-PR) are highly toxic and act as potent seeds for TDP-43 aggregation. Poly-GR enhances TDP-43's propensity to form dense, insoluble aggregates, directly linking the C9orf72 mutation to TDP-43 pathology.",
      "biological_consequence": [
        "C9orf72 repeat expansion → Poly-GR production → Direct interaction with TDP-43 → Enhanced TDP-43 aggregation → Formation of cytoplasmic inclusions → Neurodegeneration"
      ],
      "specific_effects": [
        "Poly-GR directly triggers the formation of TDP-43 aggregates.",
        "Poly-GA inclusions can also induce the intracellular aggregation of phosphorylated TDP-43.",
        "DPR accumulation, but not G4C2 RNA, is sufficient to cause TDP-43 proteinopathy in model systems.",
        "Antisense oligonucleotides that reduce DPR production also lower the number of TDP-43 aggregates in a C9orf72 mouse model."
      ],
      "evidence": [
        {
          "paper_title": "A feedback loop between dipeptide-repeat protein, TDP-43 and karyopherin-α mediates C9orf72-related neurodegeneration",
          "year": 2018,
          "pmid": "30239641"
        }
      ],
      "_context": {
        "type": "direct",
        "query_protein": null,
        "chain": null
      },
      "interaction_effect": "activates",
      "direction": "main_to_primary",
      "interaction_direction": "primary_to_main",
      "pmids": [
        "30239641"
      ],
      "function_effect": "activation"
    },
    {
      "function": "TDP-43 Nuclear Import",
      "arrow": "inhibits",
      "cellular_process": "Arginine-rich dipeptide repeat proteins (poly-GR, poly-PR) translated from the C9orf72 repeat expansion disrupt the nucleocytoplasmic transport machinery. They impair the structural integrity of the nucleus and cause the mislocalization of key transport factors like Ran and RanGAP.",
      "effect_description": "This disruption of the nuclear import machinery prevents the efficient transport of TDP-43 into the nucleus, leading to its accumulation in the cytoplasm. This links the C9orf72 mutation to TDP-43 pathology via a transport defect, in addition to direct aggregation seeding.",
      "biological_consequence": [
        "C9orf72 DPR production → Disruption of nuclear pore and transport machinery → Impaired TDP-43 nuclear import → Cytoplasmic accumulation and aggregation of TDP-43 → Neurodegeneration"
      ],
      "specific_effects": [
        "DPRs cause nuclear membrane disruption.",
        "DPRs lead to the mislocalization of Ran and RanGAP.",
        "The nuclear import defects are a fundamental mechanism of injury in C9-ALS/FTD.",
        "Antisense oligonucleotides (ASOs) that reduce sense-strand C9orf72 RNA can rescue the transport defects and restore the proper TDP-43 nuclear-to-cytoplasmic gradient."
      ],
      "evidence": [
        {
          "paper_title": "C9orf72 dipeptides disrupt the nucleocytoplasmic transport machinery and cause TDP-43 mislocalisation to the cytoplasm",
          "year": 2022,
          "pmid": "35314728"
        }
      ],
      "_context": {
        "type": "direct",
        "query_protein": null,
        "chain": null
      },
      "interaction_effect": "inhibits",
      "direction": "main_to_primary",
      "interaction_direction": "primary_to_main",
      "pmids": [
        "35314728"
      ],
      "function_effect": "inhibition"
    }
  ],
  "arrow": "regulates",
  "direction": "bidirectional",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates",
      "inhibits"
    ]
  },
  "mechanism": "Dipeptide repeat (DPR) proteins, particularly poly-glycine-arginine (poly-GR), translated from the C9orf72 repeat expansion, directly interact with TDP-43 and promote its misfolding and aggregation. Arginine-rich dipeptide repeat proteins (poly-GR, poly-PR) translated from the C9orf72 repeat expansion disrupt the nucleocytoplasmic transport machinery. They impair the structural integrity of the nucleus and cause the mislocalization of key transport factors like Ran and RanGAP.",
  "effect": "The arginine-rich DPRs (poly-GR and poly-PR) are highly toxic and act as potent seeds for TDP-43 aggregation. Poly-GR enhances TDP-43's propensity to form dense, insoluble aggregates, directly linking the C9orf72 mutation to TDP-43 pathology.; This disruption of the nuclear import machinery prevents the efficient transport of TDP-43 into the nucleus, leading to its accumulation in the cytoplasm. This links the C9orf72 mutation to TDP-43 pathology via a transport defect, in addition to direct aggregation seeding.",
  "summary": "TDP43 regulates C9orf72-DPRs to regulate tdp-43 aggregation and tdp-43 nuclear import, ultimately affecting neurodegeneration.",
  "evidence": [
    {
      "paper_title": "Key link uncovered between C9orf72 mutation and TDP-43 pathology in ALS/FTD",
      "year": 2020
    },
    {
      "paper_title": "C9orf72 poly(GR) aggregation induces TDP-43 proteinopathy",
      "year": 2020
    },
    {
      "paper_title": "A feedback loop between dipeptide-repeat protein, TDP-43 and karyopherin-α mediates C9orf72-related neurodegeneration",
      "year": 2018
    },
    {
      "paper_title": "C9orf72 dipeptides disrupt the nucleocytoplasmic transport machinery and cause TDP-43 mislocalisation to the cytoplasm",
      "year": 2022
    },
    {
      "paper_title": "The C9ORF72 repeat expansion disrupts nucleocytoplasmic transport",
      "year": 2015
    }
  ],
  "interaction_effect": "regulation",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 3
  },
  "_arrow_validated": true,
  "arrow_notation": "TDP43 <--regulates--> C9orf72-DPRs:",
  "protein_a": "C9orf72-DPRs",
  "protein_b": "TDP43",
  "discovered_in_query": "TDP43",
  "first_discovered": "2025-11-24T02:46:00.344107Z",
  "last_updated": "2025-11-24T02:46:00.344107Z"
}