{
  "primary": "TDP43",
  "interaction_type": "indirect",
  "upstream_interactor": null,
  "mediator_chain": [],
  "depth": 1,
  "support_summary": "TDP-43 can be cleaved by caspases, including Caspase-3, at several sites. This cleavage generates C-terminal fragments that are prone to aggregation and are a key feature of TDP-43 pathology in disease.",
  "functions": [
    {
      "function": "Apoptosis",
      "arrow": "activates",
      "cellular_process": "Overexpression of TDP-43 alters the transcriptional regulation of key apoptosis-related genes in the Bcl-2 family.",
      "effect_description": "TDP-43 enhances the promoter activity and mRNA expression of the pro-apoptotic protein Bim, while decreasing the mRNA and protein levels of the anti-apoptotic protein Bcl-xL. This shift in the balance of Bcl-2 family proteins promotes the activation of the apoptotic cascade.",
      "biological_consequence": [
        "TDP-43 overexpression → Increased Bim / Decreased Bcl-xL → Mitochondrial outer membrane permeabilization → Caspase activation → Apoptotic cell death"
      ],
      "specific_effects": [
        "A 2-5 fold increase in TDP-43 expression is sufficient to induce death in neuronal cells.",
        "Silencing Bim expression with siRNA can attenuate TDP-43-induced cell death.",
        "Caspase-mediated cleavage of TDP-43 may be a feedback mechanism to attenuate its toxicity, as the resulting fragments are less potent at inducing cell death."
      ],
      "evidence": [
        {
          "paper_title": "TDP-43-induced death is associated with altered regulation of BIM and Bcl-xL and attenuated by caspase-mediated TDP-43 cleavage",
          "year": 2011,
          "pmid": "21339291"
        }
      ],
      "_context": {
        "type": "direct",
        "query_protein": null,
        "chain": null
      },
      "interaction_effect": "activates",
      "direction": "main_to_primary",
      "interaction_direction": "main_to_primary",
      "pmids": [
        "21339291"
      ],
      "function_effect": "activation",
      "arrow_context": {
        "direct_from": null,
        "direct_arrow": "activates",
        "net_from": "TDP43",
        "net_arrow": "activates",
        "mediator_chain": [],
        "is_indirect": true
      },
      "net_arrow": "activates",
      "direct_arrow": "activates",
      "net_effect": "activation",
      "direct_effect": "activation"
    }
  ],
  "arrow": "regulates",
  "direction": "bidirectional",
  "intent": "regulation",
  "arrows": {
    "main_to_primary": [
      "activates"
    ]
  },
  "mechanism": "During cellular stress and apoptosis, activated caspases, including Caspase-3, can cleave full-length TDP-43 at specific sites. Overexpression of TDP-43 alters the transcriptional regulation of key apoptosis-related genes in the Bcl-2 family.",
  "effect": "This cleavage generates several C-terminal fragments (CTFs) of TDP-43, most notably a ~25 kDa fragment. These CTFs lack the nuclear localization signal, are highly prone to aggregation, and are a major component of the pathological inclusions found in patient neurons, representing a key step in TDP-43 pathology.; TDP-43 enhances the promoter activity and mRNA expression of the pro-apoptotic protein Bim, while decreasing the mRNA and protein levels of the anti-apoptotic protein Bcl-xL. This shift in the balance of Bcl-2 family proteins promotes the activation of the apoptotic cascade.",
  "summary": "TDP43 activates Caspase-3 to regulate tdp-43 cleavage and apoptosis, ultimately affecting cellular toxicity.",
  "evidence": [
    {
      "paper_title": "Caspase-4 cleaves TAR DNA-binding protein 43 in the execution phase of apoptosis",
      "year": 2011
    },
    {
      "paper_title": "TDP-43 C-terminal fragments are generated by caspase-3 and calpain and accumulate in the nucleus and cytoplasm of cultured cells",
      "year": 2010
    },
    {
      "paper_title": "TDP-43-induced death is associated with altered regulation of BIM and Bcl-xL and attenuated by caspase-mediated TDP-43 cleavage",
      "year": 2011
    }
  ],
  "interaction_effect": "regulates",
  "_validation_metadata": {
    "validated": true,
    "validator": "arrow_effect_validator",
    "corrections_applied": 4
  },
  "_arrow_validated": true,
  "arrow_notation": "TDP43 <--regulates--> Caspase-3:",
  "protein_a": "Caspase-3",
  "protein_b": "TDP43",
  "discovered_in_query": "TDP43",
  "first_discovered": "2025-11-24T02:46:00.370073Z",
  "last_updated": "2025-11-24T02:46:00.370073Z"
}