{
  "primary": "TBK1",
  "arrow": "activates",
  "functions": [
    {
      "function": "TBK1-mediated Phosphorylation of OPTN and OPTN-mediated TBK1 Activation",
      "arrow": "activates",
      "cellular_process": "Optineurin (OPTN) directly binds to TANK-binding kinase 1 (TBK1), forming a crucial complex for the initiation of selective autophagy. OPTN recruits TBK1 to ubiquitinated cargo, such as ubiquitinated TDP-43 aggregates, and to sites where autophagosomes are forming. This recruitment provides a platform that enables TBK1 to undergo autophosphorylation at Ser172, leading to its activation. Activated TBK1 then phosphorylates OPTN at multiple sites, including Ser177, Ser473 (within the UBAN domain), and Ser513. Phosphorylation of Ser177 enhances OPTN's binding affinity for LC3/Atg8 proteins, which is essential for recruiting autophagosomal membranes. Phosphorylation of Ser473 and Ser513 increases OPTN's capacity to bind diverse polyubiquitin chains, including phosphorylated ubiquitin (pS65 Ub), thereby stabilizing its association with ubiquitinated cargo. This reciprocal interaction establishes a positive feedback loop, where OPTN facilitates TBK1 activation, and activated TBK1 enhances OPTN's ability to link cargo to the autophagic machinery, thereby amplifying the autophagic process for efficient cargo degradation.",
      "effect_description": "OPTN recruits and activates TBK1, which in turn phosphorylates OPTN, enhancing its ability to bind ubiquitinated cargo (like TDP-43) and LC3, thereby promoting autophagosome formation and cargo degradation.",
      "biological_consequence": [
        "OPTN recruits TBK1 to ubiquitinated cargo (e.g., ubiquitinated TDP-43) and autophagosome formation sites.",
        "OPTN provides a platform for TBK1 autophosphorylation and activation.",
        "Activated TBK1 phosphorylates OPTN at Ser177, Ser473, and Ser513.",
        "Phosphorylated OPTN exhibits enhanced binding to LC3/Atg8 proteins and diverse polyubiquitin chains.",
        "This enhanced binding facilitates the sequestration of ubiquitinated cargo, including ubiquitinated TDP-43, into autophagosomes for degradation, thereby initiating and amplifying selective autophagy."
      ],
      "specific_effects": [
        "TBK1 activation (autophosphorylation at S172).",
        "Enhanced OPTN binding to LC3/Atg8 proteins.",
        "Increased OPTN affinity for polyubiquitin chains (e.g., on TDP-43).",
        "Promotion of autophagosome formation around ubiquitinated cargo.",
        "Initiation and amplification of selective autophagy."
      ],
      "evidence": [
        {
          "paper_title": "Phosphorylation of OPTN by TBK1 enhances its binding to Ub chains and promotes selective autophagy of damaged mitochondria",
          "year": 2016
        },
        {
          "paper_title": "Optineurin provides a mitophagy contact site for TBK1 activation",
          "year": 2024
        }
      ]
    }
  ],
  "interaction_type": "direct",
  "discovered_in_query": "TDP43",
  "protein_a": "OPTN",
  "protein_b": "TBK1",
  "first_discovered": "2025-11-24T02:39:18.399390Z",
  "last_updated": "2025-11-24T02:39:18.399390Z"
}